app/controllers/students_controller.rb

    def edit
        @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]